Config/Documents/ЮЦАУ_ДанныеПоМаршрутам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЮЦАУ_ДанныеПоМаршрутам</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияТоваровНаСкладе</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЮЦАУ_ОборотыПоМаршрутам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоМаршрутам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутевойЛистНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮЦАУ_Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееВремя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выручка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПассажиров</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕздок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробегСПассажирами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ЮЦАУ_ОсновныеМаршрутыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮЦАУ_ОсновныеМаршрутыТС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮЦАУ_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮЦАУ_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТранспортныеСредства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Топливо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйЗнакПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформляютсяПутевыеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/НоменклатурныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НоменклатурныеГруппы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ЮЦАУ_ДанныеПоМаршрутам/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
		Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ОбщегоНазначенияБПКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "ПроведениеЮЦАУ_ДанныеПоМаршрутам";
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	Если НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДатаДокумента) Тогда
		// Изменение времени не влияет на поведение документа.
		ТекущаяДатаДокумента = Объект.Дата;
		Возврат;
	КонецЕсли;

	// Общие проверки условий по датам.
	ТребуетсяВызовСервера = ОбщегоНазначенияБПКлиент.ТребуетсяВызовСервераПриИзмененииДатыДокумента(Объект.Дата, 
		ТекущаяДатаДокумента);

	// Если определили, что изменение даты может повлиять на какие-либо параметры, 
	// то передаем обработку на сервер.
	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;

	// Запомним новую дату документа.
	ТекущаяДатаДокумента = Объект.Дата;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВозвратнаяТара


#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьСвязанныеЗаписи()
	
	//УдалитьСвязанныеЗаписиНаСервере();
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСвойстваФормыДанныеПоМаршрутам();
	
	УстановитьСостояниеДокумента();
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваФормыДанныеПоМаршрутам()
	
	УстановитьФункциональныеОпцииФормы();
		
	ТекущаяДатаДокумента = Объект.Дата;
		
	УстановитьВидимостьНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	//Если Объект.ВидОперации <> Перечисления.ВидыОперацийСписаниеТоваров.СписаниеСоСклада Тогда
	//	Возврат;
	//КонецЕсли;
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	//СпособОценкиТоваровВРознице	= УчетнаяПолитика.СпособОценкиТоваровВРознице(Объект.Организация, Объект.Дата);
	//УчетВПродажныхЦенах			= (СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	//
	//СпособОценкиМПЗ	= УчетнаяПолитика.СпособОценкиМПЗ(Объект.Организация, Объект.Дата);
	//СпособОценкиМПЗПоСредней	= (СпособОценкиМПЗ = Перечисления.СпособыОценки.ПоСредней);
	//
	//ИспользоватьКонтрольныеЗнакиГИСМ = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольныеЗнакиГИСМ");
	//
	//ВедетсяУчетПрослеживаемыхТоваров  = ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров")
	//	И ПрослеживаемостьБРУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
			
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНаСервере()

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	Элементы.ПодразделениеОрганизации.Доступность		= ЗначениеЗаполнено(Объект.Организация);
	Элементы.ДанныеПоМаршрутамЗаполнитьИзУАТ.Доступность = Не Форма.ТолькоПросмотр;
		
КонецПроцедуры


&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	
	УправлениеФормой(ЭтаФорма);
	
//	РаботаСНоменклатуройБП.ОбновитьПризнакПрослеживаемости(Объект.Товары, ЭтотОбъект.ВедетсяУчетПрослеживаемыхТоваров);

	//Для Каждого Строка Из Объект.Товары Цикл
	//	ПрослеживаемостьФормыКлиентСерверБП.ЗаполнитьПредставлениеРНПТ(ЭтаФорма, Строка)
	//КонецЦикла;
	//НастроитьВидимостьПризнакаОтраженияВПрослеживаемости();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	УстановитьФункциональныеОпцииФормы();
	
	//ПодразделениеОрганизации = ОбщегоНазначенияБПВызовСервера.ПолучитьПодразделение(Объект.Организация, Объект.Склад);
	//
	//СчетаУчетаВДокументах.ЗаполнитьОбъектПриИзменении(НачатьЗаполнениеСчетовУчета("Организация", Объект));
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборВставкаИзБуфераНаСервере(ВыбранноеЗначение, ИмяТаблицы)

	//ЭтоВставкаИзБуфера = ВыбранноеЗначение.Свойство("ЭтоВставкаИзБуфера");
	//СписокСвойств = Неопределено;
	//Если ЭтоВставкаИзБуфера Тогда
	//	
	//	ТаблицаТоваров = ВыбранноеЗначение.Данные;
	//	СписокСвойств = ВыбранноеЗначение.СписокСвойств;
	//	
	//Иначе
	//	
	//	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	//	
	//КонецЕсли;
	//
	//ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
	//ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	//
	//СоответствиеСведенийОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(
	//	ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаТоваров, "Номенклатура", Истина), ДанныеОбъекта, Ложь);
	//
	//ЗаполнитьСтавкиНДСВРознице	= НТТ И УчетВПродажныхЦенах И РазделятьПоСтавкамНДС;
	//
	//СтрокиДляЗаполненияСчетов = Новый Массив;
	//
	//Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
	//	
	//	СведенияОНоменклатуре = СоответствиеСведенийОНоменклатуре.Получить(СтрокаТовара.Номенклатура);
	//	Если ЭтоВставкаИзБуфера
	//		И СведенияОНоменклатуре <> Неопределено
	//		И ЗначениеЗаполнено(СведенияОНоменклатуре.Услуга)
	//		И СведенияОНоменклатуре.Услуга Тогда
	//		
	//		Продолжить;
	//		
	//	КонецЕсли;
	//	СтрокаТабличнойЧасти = Объект[ИмяТаблицы].Добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТовара, СписокСвойств);
	//	СтрокиДляЗаполненияСчетов.Добавить(СтрокаТабличнойЧасти);
	//	
	//	Если СведенияОНоменклатуре = Неопределено Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если ИмяТаблицы = "Товары" Тогда
	//		
	//		СтрокаТабличнойЧасти.ЕдиницаИзмерения		= ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения),
	//			СтрокаТабличнойЧасти.ЕдиницаИзмерения, СведенияОНоменклатуре.ЕдиницаИзмерения);
	//		СтрокаТабличнойЧасти.Коэффициент			= ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Коэффициент),
	//			СтрокаТабличнойЧасти.Коэффициент, СведенияОНоменклатуре.Коэффициент);
	//		СтрокаТабличнойЧасти.НомерГТД				= ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.НомерГТД),
	//			СтрокаТабличнойЧасти.НомерГТД, СведенияОНоменклатуре.НомерГТД);
	//		СтрокаТабличнойЧасти.СтранаПроисхождения	= ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтранаПроисхождения),
	//			СтрокаТабличнойЧасти.СтранаПроисхождения, СведенияОНоменклатуре.СтранаПроисхождения);
	//		Если ВедетсяУчетПрослеживаемыхТоваров Тогда
	//			СтрокаТабличнойЧасти.ПрослеживаемыйТовар       = СведенияОНоменклатуре.ПрослеживаемыйТовар;
	//		Иначе
	//			СтрокаТабличнойЧасти.ПрослеживаемыйТовар       = Ложь;
	//		КонецЕсли;
	//		
	//		Если НТТ Тогда
	//				
	//			СтрокаТабличнойЧасти.Цена = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена),
	//				СтрокаТабличнойЧасти.Цена, СведенияОНоменклатуре.ЦенаВРознице);
	//				
	//			Если ЗаполнитьСтавкиНДСВРознице Тогда
	//				СтрокаТабличнойЧасти.СтавкаНДСВРознице = СведенияОНоменклатуре.СтавкаНДСВРознице;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//		СтрокаТабличнойЧасти.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
	//		
	//		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиДляЗаполненияСчетов, ИмяТаблицы, Объект, Документы.СписаниеТоваров);
	//
	//Если ЭтоВставкаИзБуфера Тогда
	//	
	//	ВыбранноеЗначение.КоличествоДобавленныхСтрок = СтрокиДляЗаполненияСчетов.Количество();
	//	
	//КонецЕсли;
	//
	//ЗаполнитьДобавленныеКолонкиТаблиц();
	//НастроитьВидимостьПризнакаОтраженияВПрослеживаемости();
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыВоВременноеХранилищеНаСервере()

	Возврат ПоместитьВоВременноеХранилище(Объект.Товары.Выгрузить(), УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Функция ПолучитьПараметрыОбработкиТабличнойЧастиТовары()

	ПараметрыОбработки = Новый Структура;
	
	ПараметрыОбработки.Вставить("АдресХранилищаТовары", 		ПоместитьТоварыВоВременноеХранилищеНаСервере());
	ПараметрыОбработки.Вставить("ЗаполнятьЦеныПоПокупке", 		Ложь);
	ПараметрыОбработки.Вставить("ДокументСсылка", 				Объект.Ссылка);
	ПараметрыОбработки.Вставить("ДокументДата", 				Объект.Дата);
	ПараметрыОбработки.Вставить("ДокументОрганизация", 			Объект.Организация);
	ПараметрыОбработки.Вставить("ДокументСклад", 				Объект.Склад);
	
	// Реквизиты Цена и Сумма отражаются на форме только для НТТ
	//Если НЕ НТТ Тогда
	//	ПараметрыОбработки.Вставить("ИсключатьРеквизиты", "Цена,Сумма");
	//КонецЕсли; 
	
	Возврат ПараметрыОбработки;

КонецФункции 

&НаСервере
Процедура ОбработкаОповещенияОбработкиТабличнойЧастиТоварыНаСервере(Параметры)

	//СтрокиДляДополнительнойОбработки = Обработки.ИзменениеТаблицыТоваров.ЗагрузитьТабличнуюЧастьВДанныеФормы(Объект.Товары, Параметры);
	//
	//// ОтражениеВУСН
	//Для Каждого СтрокаТабличнойЧасти ИЗ СтрокиДляДополнительнойОбработки Цикл
	//	СтрокаТабличнойЧасти.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
	//КонецЦикла;
	//
	//// СтавкаНДСВРознице
	//ЗаполнитьСтавкиНДСВРознице = НТТ И УчетВПродажныхЦенах И РазделятьПоСтавкамНДС;
	//Если ЗаполнитьСтавкиНДСВРознице Тогда
	//	
	//	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
	//	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	//	СоответствиеСведенийОНоменклатуре	= БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(
	//		ОбщегоНазначения.ВыгрузитьКолонку(СтрокиДляДополнительнойОбработки, "Номенклатура", Истина), ДанныеОбъекта, Ложь, Ложь);
	//
	//	Для Каждого СтрокаТабличнойЧасти ИЗ СтрокиДляДополнительнойОбработки Цикл
	//		
	//		СведенияОНоменклатуре = СоответствиеСведенийОНоменклатуре.Получить(СтрокаТабличнойЧасти.Номенклатура);
	//		Если СведенияОНоменклатуре = Неопределено Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		СтрокаТабличнойЧасти.СтавкаНДСВРознице = СведенияОНоменклатуре.СтавкаНДСВРознице;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	// Счета учета
	//СчетаУчетаВДокументах.ЗаполнитьСтроки(СтрокиДляДополнительнойОбработки, "Товары", Объект, Документы.СписаниеТоваров, Истина);
	
	//ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзУАТНаСервере()
	
	//Подключение к УАТ
	ПараметрыПодключения = ЮЦАУ.ПолучитьПараметрыПодключения_УАТ(Объект.Организация);
	
	Если ПараметрыПодключения = Неопределено Тогда
		Сообщить("Не определены параметры подключения к УАТ!");
		Возврат;
	КонецЕсли;	
	
	Попытка		
		Если ПараметрыПодключения.Порт <= 0 Тогда 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		Иначе 
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,ПараметрыПодключения.Порт,ПараметрыПодключения.Пользователь,ПараметрыПодключения.Пароль);
		КонецЕсли;	
	Исключение
		Сообщить("Не удалось подключиться по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ДатаНачала = НачалоМесяца(Объект.Дата);
	ДатаКонца = КонецМесяца(Объект.Дата);
	//http://localhost/UAT/hs/api_uat/RouteData?StartDate=01.10.2022&EndDate=31.10.2022
	РесурсНаСервере = "/UAT/hs/api_uat/RouteData?StartDate="+Формат(ДатаНачала,"ДЛФ=Д")+"&EndDate="+Формат(ДатаКонца,"ДЛФ=Д");
	
	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
			
	//Получаем ответный текст или текст ошибки  
	Если HTTPОтвет.КодСостояния = 401 Тогда
		Сообщить("Не удалось авторизоваться в программе УАТ. Неверный логин или пароль. HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
		Сообщить("HTTPОтвет.КодСостояния: " + HTTPОтвет.КодСостояния);
	Иначе	

		СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		ПолучитьСтруктуруИзJSON(СтрокаJSON);
		ДесериализоватьJSONИЗагрузитьДокументы(СтрокаJSON);  

	КонецЕсли;		
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТранспортноеСредство(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ТранспортныеСредства.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		//Если СтруктураОбъекта.ЭтоГруппа Тогда
		//	ОбъектКакОбъект = Справочники.ТранспортныеСредства.СоздатьГруппу();   
		//	ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
		//Иначе   

			ОбъектКакОбъект = Справочники.ТранспортныеСредства.СоздатьЭлемент();
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
			ОбъектКакОбъект.РегистрационныйЗнак = СтруктураОбъекта.ГосударственныйНомер;  
			
			ОбъектКакОбъект.Модель = ПолучитьМодель(СтруктураОбъекта.Модель);
			ОбъектКакОбъект.ТипТС = ПолучитьТипТС(СтруктураОбъекта.ТипТС);

		//КонецЕсли;

		//Если СтруктураОбъекта.Свойство("Родитель") Тогда      //В Бух. необязательны группы ТС
		//	ОбъектКакОбъект.Родитель = ПолучитьТранспортноеСредство(СтруктураОбъекта.Родитель);	
		//КонецЕсли;	
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();
		
		Возврат ОбъектКакОбъект.Ссылка;	
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьМодель(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.уатМоделиТС.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда
			ОбъектКакОбъект = Справочники.уатМоделиТС.СоздатьГруппу();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
		Иначе
			
			ОбъектКакОбъект = Справочники.уатМоделиТС.СоздатьЭлемент();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
			ОбъектКакОбъект.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт;	
			
			ОбъектКакОбъект.ТипТС = ПолучитьТипТС(СтруктураОбъекта.ТипТС);
			
		КонецЕсли;		
		
		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьМодель(СтруктураОбъекта.Родитель);	
		КонецЕсли;	
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	

		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьТипТС(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.уатТипыТС.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда
			ОбъектКакОбъект = Справочники.уатТипыТС.СоздатьГруппу();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
		Иначе
			ОбъектКакОбъект = Справочники.уатТипыТС.СоздатьЭлемент();
			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование; 
			ОбъектКакОбъект.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт;	
			
			ОбъектКакОбъект.ТипТС = ПолучитьТипТС(СтруктураОбъекта.ТипТС);
		КонецЕсли;
		
		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьТипТС(СтруктураОбъекта.Родитель);	
		КонецЕсли;	
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	

		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьПодразделение(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИДСсылки);
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		//Попытка поиска подразделения по идентификатору
		ПодразделениеСсылка = ПолучитьОбъектПоИдентификатору(СтруктураОбъекта.Идентификатор);
		Если ПодразделениеСсылка <> Неопределено Тогда   
			Возврат ПодразделениеСсылка;
		КонецЕсли;	
		
		Сообщить("Не найдено подразделение: " + СтруктураОбъекта.Идентификатор + " Код: " + СтруктураОбъекта.Код + "  " + СтруктураОбъекта.Наименование);
		Возврат Неопределено; 
		
	Иначе     

		Если СтруктураОбъекта.Код <> СсылкаВИБ.Код Тогда
			Сообщить("Отличается код для подразделения: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Код + " СсылкаВИБ.Код: " + СсылкаВИБ.Код);
		КонецЕсли;	
		
		Если СтруктураОбъекта.Наименование <> СсылкаВИБ.Наименование Тогда
			Сообщить("Отличается наименование для подразделения: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Наименование + " СсылкаВИБ.Наименование: " + СсылкаВИБ.Наименование);
		КонецЕсли;	

		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Процедура ДесериализоватьJSONИЗагрузитьДокументы(СтрокаJSON)
	
	СоздаватьОбъекты = Истина;
	
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("Период");
	МассивПолейДат.Добавить("ДатаПериода");
	МассивПолейДат.Добавить("ФизлицоДатаРождения");
	СписокСтрок = ДесериализоватьJSON(СтрокаJSON, МассивПолейДат);	
	
	//Получение Основного маршрута для ТС
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОсновныеМаршрутыТССрезПоследних.Маршрут КАК Маршрут
		|ИЗ
		|	РегистрСведений.ЮЦАУ_ОсновныеМаршрутыТС.СрезПоследних(&ДатаПериода, ) КАК ЮЦАУ_ОсновныеМаршрутыТССрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортноеСредство,
		|	Маршрут
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаПериода", КонецМесяца(Объект.Дата));
	тзСоответствиеТСиМаршрута = Запрос.Выполнить().Выгрузить();

	//Получение Номенклатурной группы для маршрута
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних.Маршрут КАК Маршрут
		|ИЗ
		|	РегистрСведений.ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппы.СрезПоследних(&ДатаПериода, ) КАК ЮЦАУ_СоответствиеМаршрутаИНоменклатурнойГруппыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаПериода", КонецМесяца(Объект.Дата));
	тзСоответствиеМаршрутаИНоменклатурнойГруппы = Запрос.Выполнить().Выгрузить();

	//Спецификация маршрутов
	Маршрут_Перегон = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Маршрут_Перегон", Объект.Организация, Объект.Дата);
	Маршрут_Резерв = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Маршрут_Резерв", Объект.Организация, Объект.Дата);
	Маршрут_ПеревозкаЛюдейПоГороду = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Маршрут_ПеревозкаЛюдейПоГороду", Объект.Организация, Объект.Дата);
	ПодразделениеАвтоколоннаПассажирскиеПеревозки = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки");
	
	Если Маршрут_Перегон = Неопределено Тогда
		Сообщить("Не установлено значение маршрута Маршрут_Перегон");
	КонецЕсли;	
	
	Если Маршрут_Резерв = Неопределено Тогда
		Сообщить("Не установлено значение маршрута Маршрут_Резерв");
	КонецЕсли;	

	Если Маршрут_ПеревозкаЛюдейПоГороду = Неопределено Тогда
		Сообщить("Не установлено значение маршрута Маршрут_ПеревозкаЛюдейПоГороду");
	КонецЕсли;	                  

	Если ПодразделениеАвтоколоннаПассажирскиеПеревозки = Неопределено Тогда
		Сообщить("Не установлено значение подразделения ПодразделениеАвтоколоннаПассажирскиеПеревозки");
	КонецЕсли;	                  

	Для Каждого СтруктураСтроки Из СписокСтрок.ДанныеПоМаршрутам Цикл
		
		ТранспортноеСредство = Неопределено;
		СчетЗатрат = Неопределено;
		Подразделение = Неопределено;
		
		Если СтруктураСтроки.Свойство("ТранспортноеСредство") Тогда
			ТранспортноеСредство = ПолучитьТранспортноеСредство(СтруктураСтроки.ТранспортноеСредство);
		КонецЕсли;	

		Если СтруктураСтроки.Свойство("Подразделение") Тогда
			Подразделение = ПолучитьПодразделение(СтруктураСтроки.Подразделение);
		КонецЕсли;	

		Маршрут = Неопределено;  
		НоменклатурнаяГруппа = Неопределено;
		Если Подразделение = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеАвтоколоннаПассажирскиеПеревозки") Тогда
			
			СчетЗатрат = ПланыСчетов.Хозрасчетный.ЭксплуатацияМаршрутныхАвтобусов; //25.03
			Если СтруктураСтроки.Свойство("Маршрут") Тогда
				Маршрут = ПолучитьМаршрут(СтруктураСтроки.Маршрут);
			КонецЕсли;	

			//Обработка перегона и резерва     
			ОсновнойМаршрут = Маршрут;
			Если Маршрут = Неопределено ИЛИ Маршрут = Маршрут_Перегон ИЛИ Маршрут = Маршрут_Резерв ИЛИ Маршрут = Маршрут_ПеревозкаЛюдейПоГороду Тогда
					
				//Поиск основного маршрута для транспортного средства  
				НайденнаяСтрока = тзСоответствиеТСиМаршрута.Найти(ТранспортноеСредство, "ТранспортноеСредство"); 
				Если НайденнаяСтрока = Неопределено Тогда   
					Сообщить("Не удалось определить основной маршрут для ТС: " + ТранспортноеСредство);
				Иначе	
					ОсновнойМаршрут = НайденнаяСтрока.Маршрут;
				КонецЕсли;	
					
			КонецЕсли;	    
			
			//НоменклатурнаяГруппа = "";
			Если ОсновнойМаршрут <> Неопределено Тогда
				НайденнаяСтрока = тзСоответствиеМаршрутаИНоменклатурнойГруппы.Найти(ОсновнойМаршрут, "Маршрут"); 
				Если НайденнаяСтрока = Неопределено Тогда   
					Сообщить("Не удалось определить номенклатурную группу для маршрута: " + ОсновнойМаршрут);
				Иначе	
					НоменклатурнаяГруппа = НайденнаяСтрока.НоменклатурнаяГруппа;    
				КонецЕсли;	
			КонецЕсли;			

			Если Маршрут = Неопределено Тогда
				
				ТекстСообщения = "Не указан маршрут для ТС: " + ТранспортноеСредство;
				Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
					ТекстСообщения = ТекстСообщения + ". По умолчанию будет использована номенклатурная группа: " + НоменклатурнаяГруппа;
				КонецЕсли;
				
				Сообщить(ТекстСообщения);
				
			КонецЕсли;			

		Иначе	//Номенклатурная группа для учета затрат по автотранспорту
			
			Если СтруктураСтроки.Свойство("НоменклатурнаяГруппа") Тогда                                 
				НоменклатурнаяГруппа = ПолучитьНоменклатурнуюГруппу(СтруктураСтроки.НоменклатурнаяГруппа);
			КонецЕсли;	
			
			СчетЗатрат = ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники; //25.02
			
		КонецЕсли;
		
		НоваяСтрока = Объект.ДанныеПоМаршрутам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		НоваяСтрока.ТранспортноеСредство = ТранспортноеСредство;
		НоваяСтрока.Подразделение = Подразделение;
		НоваяСтрока.СчетЗатрат = СчетЗатрат;
		НоваяСтрока.Сотрудник = ПолучитьФизлицо(СтруктураСтроки);    
		НоваяСтрока.Маршрут = Маршрут; 
		НоваяСтрока.НоменклатурнаяГруппа = НоменклатурнаяГруппа;    
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатурнуюГруппу(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		//Сообщить("Не найдена номенклатурная группа: " + СтруктураОбъекта.Идентификатор + " Код: " + СтруктураОбъекта.Код + "  " + СтруктураОбъекта.Наименование);

		//Сначала поиск по ссылке затем поиск по регистру "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
		НоменклатурнаяГруппаСсылка = ПолучитьОбъектПоИдентификатору(СтруктураОбъекта.Идентификатор);  //Получаем по ранее установленному соответствию
		Если НоменклатурнаяГруппаСсылка <> Неопределено Тогда
			Возврат НоменклатурнаяГруппаСсылка;  
		Иначе
			Сообщить("Не найдена номенклатурная группа: " + СтруктураОбъекта.Идентификатор + " Код: " + СтруктураОбъекта.Код + "  " + СтруктураОбъекта.Наименование);
			//тест
			//Возврат Неопределено;
		КонецЕсли;	
	
		
		//Возврат Неопределено; //Не надо ничего создавать
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда
			ОбъектКакОбъект = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
		Иначе	
			ОбъектКакОбъект = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
		КонецЕсли;

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьНоменклатурнуюГруппу(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе        
		
		//Если СтруктураОбъекта.Код <> СсылкаВИБ.Код Тогда
		//	Сообщить("Отличается код для номенклатурной группы: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Код + " СсылкаВИБ.Код: " + СсылкаВИБ.Код);
		//КонецЕсли;	
		//
		//Если СтруктураОбъекта.Наименование <> СсылкаВИБ.Наименование Тогда
		//	Сообщить("Отличается наименование для номенклатурной группы: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Наименование + " СсылкаВИБ.Наименование: " + СсылкаВИБ.Наименование);
		//КонецЕсли;	

		//Возврат СсылкаВИБ;     
		
		//Сначала поиск по ссылке затем поиск по регистру "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
		Если СтруктураОбъекта.Код = СсылкаВИБ.Код И СтруктураОбъекта.Наименование = СсылкаВИБ.Наименование Тогда // В точности нужный элемент
			//Сообщить("Отличается код для номенклатурной группы: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Код + " СсылкаВИБ.Код: " + СсылкаВИБ.Код);
			Возврат СсылкаВИБ;     
		Иначе 
			НоменклатурнаяГруппаСсылка = ПолучитьОбъектПоИдентификатору(СтруктураОбъекта.Идентификатор);  //Получаем по ранее установленному соответствию
			Если НоменклатурнаяГруппаСсылка <> Неопределено Тогда
				Возврат НоменклатурнаяГруппаСсылка;  
			Иначе
				Сообщить("Не найдена номенклатурная группа: " + СтруктураОбъекта.Идентификатор + " Код: " + СтруктураОбъекта.Код + "  " + СтруктураОбъекта.Наименование);
				Возврат Неопределено;
			КонецЕсли;	
	
		КонецЕсли;	
		
		//Если СтруктураОбъекта.Наименование <> СсылкаВИБ.Наименование Тогда
			//Сообщить("Отличается наименование для номенклатурной группы: " + СтруктураОбъекта.Идентификатор + " " + СтруктураОбъекта.Наименование + " СсылкаВИБ.Наименование: " + СсылкаВИБ.Наименование);
		//КонецЕсли;	

	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьМаршрут(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ЮЦАУ_Маршруты.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда
			ОбъектКакОбъект = Справочники.ЮЦАУ_Маршруты.СоздатьГруппу();
		Иначе	
			ОбъектКакОбъект = Справочники.ЮЦАУ_Маршруты.СоздатьЭлемент();
		КонецЕсли;

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьМаршрут(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьПолФизлица(ПолСтрокой)
	
	Если ПолСтрокой = "Мужской" Тогда
		Возврат Перечисления.ПолФизическогоЛица.Мужской;
	ИначеЕсли ПолСтрокой = "Женский" Тогда
		Возврат Перечисления.ПолФизическогоЛица.Женский;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция ПолучитьФизлицо(СтруктураСтроки)
	
	Идентификатор = СтруктураСтроки.ФизлицоИдентификатор;
	ИНН = СтруктураСтроки.ФизлицоИНН;
	Наименование = СтруктураСтроки.ФизлицоНаименование;
	ПолСтрокой = СтруктураСтроки.ФизлицоПол;
	ДатаРождения = СтруктураСтроки.ФизлицоДатаРождения;
	
	ФизлицоСсылка = ПолучитьОбъектПоИдентификатору(Идентификатор);  //Получаем по ранее установленному соответствию
	Если ФизлицоСсылка <> Неопределено Тогда
		Возврат ФизлицоСсылка;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Сообщить("Не указан ИНН для физлица: " + Наименование);
		Возврат Неопределено;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Наименование = &Наименование
	|	И ФизическиеЛица.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	ФизлицоСсылка = Неопределено;
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ФизлицоСсылка = ВыборкаДетальныеЗаписи.Ссылка;  
		Прервать;
	КонецЦикла;
	
	Если ФизлицоСсылка = Неопределено Тогда
		
		Сообщить("Не удалось подобрать физлицо по наименованию: " + Наименование + " и ИНН: " + ИНН);
		Возврат ФизлицоСсылка; //Добавлять физлица из УАТ в автоматическом режиме не следует
		
	//	ФизлицоОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
	//	ФизлицоОбъект.Наименование = Наименование;
	//	ФизлицоОбъект.ДатаРождения = ДатаРождения;
	//	ФизлицоОбъект.Пол = ПолучитьПолФизлица(ПолСтрокой);
	//	ФизлицоОбъект.ИНН = ИНН;
	//	ФизлицоОбъект.Записать(); 
	//	ФизлицоСсылка = ФизлицоОбъект.Ссылка;
		
	КонецЕсли;
	
	//Добавление физлица в регистр ПубличныеИдентификаторыСинхронизируемыхОбъектов
	НаборЗаписей = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей(); 

	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор); 
	НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Неопределено); 

	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Идентификатор = Идентификатор; 
	НоваяЗапись.УзелИнформационнойБазы = Неопределено; 
	НоваяЗапись.Ссылка = ФизлицоСсылка; 

	НаборЗаписей.Записать(); 
	
	Возврат ФизлицоСсылка;
	
КонецФункции	


//&НаСервере
//Функция ПолучитьСотрудникаПоФизлицу(Физлицо, Наименование)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Сотрудники.Ссылка КАК Ссылка
//		|ИЗ
//		|	Справочник.Сотрудники КАК Сотрудники
//		|ГДЕ
//		|	Сотрудники.Наименование = &Наименование
//		|	И Сотрудники.ФизическоеЛицо = &ФизическоеЛицо";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("ФизическоеЛицо", Физлицо);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Возврат ВыборкаДетальныеЗаписи.Ссылка;
//	КонецЦикла;
//	
//	СотрудникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
//	СотрудникОбъект.Наименование = Наименование;
//	СотрудникОбъект.ФизическоеЛицо = Физлицо;
//	СотрудникОбъект.Записать();

//	Возврат СотрудникОбъект.Ссылка;
//	
//КонецФункции	


//&НаСервере
//Функция ПолучитьСотрудника(СтруктураСтроки, Организация, СоздаватьОбъекты);

//	СотрудникИдентификатор = СтруктураСтроки.СотрудникИдентификатор;
//	СотрудникНаименование = СтруктураСтроки.СотрудникНаименование;
//	
//	СотрудникСсылка = ПолучитьОбъектПоИдентификатору(СотрудникИдентификатор);  //Получаем по ранее установленному соответствию
//	Если СотрудникСсылка = Неопределено Тогда
//		
//		ФизлицоНаименование = СтруктураСтроки.ФизлицоНаименование;
//		ФизлицоИНН = СтруктураСтроки.ФизлицоИНН;
//		ФизлицоПол = СтруктураСтроки.ФизлицоПол;
//		ФизлицоДатаРождения = СтруктураСтроки.ФизлицоДатаРождения;
//		Физлицо = ПолучитьФизлицо(ФизлицоНаименование, ФизлицоИНН, ФизлицоПол, ФизЛицоДатаРождения, СоздаватьОбъекты);

//		Если Физлицо = Неопределено Тогда
//			СотрудникСсылка = Неопределено;
//		Иначе	
//			
//			СотрудникСсылка = ПолучитьСотрудникаПоФизлицу(Физлицо, СотрудникНаименование);  
//			
//			//Добавление сотрудника в регистр
//			НаборЗаписей = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей(); 

//			НаборЗаписей.Отбор.Идентификатор.Установить(СотрудникИдентификатор); 
//			НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Неопределено); 

//			НоваяЗапись = НаборЗаписей.Добавить(); 
//			НоваяЗапись.Идентификатор = СотрудникИдентификатор; 
//			НоваяЗапись.УзелИнформационнойБазы = Неопределено; 
//			НоваяЗапись.Ссылка = СотрудникСсылка; 

//			НаборЗаписей.Записать(); 
//			
//		КонецЕсли;	
//		
//	КонецЕсли;	
//	
//	Возврат СотрудникСсылка;
//	
//КонецФункции
	

&НаСервере
Функция ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
		|ГДЕ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор = &Идентификатор
		|	И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции	
	

//&НаСервере
//Функция ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта, НаименованиеОбъекта, ТипОбъекта, ДополнительныйРеквизит=Неопределено, СоздаватьОбъекты=Ложь)

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка
//		|ИЗ
//		|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
//		|ГДЕ
//		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор = &Идентификатор
//		|	И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = НЕОПРЕДЕЛЕНО";
//	
//	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторОбъекта);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
//		Возврат ВыборкаДетальныеЗаписи.Ссылка;
//	КонецЦикла;
//	
//	Если СоздаватьОбъекты Тогда     
//		
//		ОбъектСсылка = ПолучитьСсылкуОбъекта(НаименованиеОбъекта, ДополнительныйРеквизит, ТипОбъекта); 
//		Если ОбъектСсылка <> Неопределено Тогда
//		
//			НаборЗаписей = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей(); 

//			НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторОбъекта); 
//			НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Неопределено); 

//			НоваяЗапись = НаборЗаписей.Добавить(); 
//			НоваяЗапись.Идентификатор = ИдентификаторОбъекта; 
//			НоваяЗапись.УзелИнформационнойБазы = Неопределено; 
//			НоваяЗапись.Ссылка = ОбъектСсылка; 

//			НаборЗаписей.Записать(); 
//			
//		КонецЕсли;			
//		
//		Возврат ОбъектСсылка;
//		
//	Иначе	
//		Сообщить("Не удалось определить объект с типом: " + ТипОбъекта + " для УИН: " + ИдентификаторОбъекта + " с наименованием: " + НаименованиеОбъекта);
//		Возврат Неопределено;
//	КонецЕсли;	
//	
//КонецФункции	

//&НаСервере
//Функция ПолучитьСсылкуОбъекта(НаименованиеОбъекта, ДополнительныйРеквизит, ТипОбъекта)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ФизическиеЛица.Ссылка КАК Ссылка
//		|ИЗ
//		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
//		|ГДЕ
//		|	ФизическиеЛица.Наименование = &Наименование
//		|	И ФизическиеЛица.ИНН <> """"";
//	
//	Запрос.УстановитьПараметр("Наименование", НаименованиеОбъекта);
//	
//	Если ТипОбъекта = "Сотрудник" Тогда
//	ИначеЕсли ТипОбъекта = "ФизическоеЛицо" Тогда
//	Иначе	
//		Сообщить("Неожиданное значение типа объекта: " + ТипОбъекта);
//		Возврат Неопределено;
//	КонецЕсли;	
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Возврат ВыборкаДетальныеЗаписи.Ссылка;
//	КонецЦикла;
//	
//	Если ТипОбъекта = "Сотрудник" Тогда //В качестве субконто "Сотрудники" выступают физические лица
//		
//		НовыйОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
//		НовыйОбъект.Наименование = НаименованиеОбъекта;
//		НовыйОбъект.Записать();
//		Возврат НовыйОбъект.Ссылка;
//		
//	ИначеЕсли ТипОбъекта = "ФизическоеЛицо" Тогда

//		НовыйОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
//		НовыйОбъект.Наименование = НаименованиеОбъекта;
//		НовыйОбъект.Записать();
//		Возврат НовыйОбъект.Ссылка;

//	КонецЕсли;	

//	Возврат Неопределено;
//	
//КонецФункции	




// Функция для десериализации в JSON
&НаСервере
Функция ПолучитьСтруктуруИзJSON(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	СтруктураИзJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат СтруктураИзJSON;
	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьИзУАТ(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Не выбрана организация!");
		Возврат;
	КонецЕсли;	
	
	Если Объект.ДанныеПоМаршрутам.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемТабличнойЧастиДанныеПоМаршрутамЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
			НСтр("ru = 'Загрузка данных из УАТ'"));
	Иначе	
		ЗаполнитьИзУАТНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиДанныеПоМаршрутамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ДанныеПоМаршрутам.Очистить();
		ЗаполнитьИзУАТНаСервере();
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ДесериализоватьJSON(СтрокаJSON, ПоляДат = "")

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Объект = ПрочитатьJSON(ЧтениеJSON,, ПоляДат, ФорматДатыJSON.ISO);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Объект;
	
КонецФункции


#КонецОбласти
